src/InformationRegisters/Scan_ИсторияПоКонтрагентам/Scan_ИсторияПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияПоКонтрагентам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ИсторияПоКонтрагентам/ManagerModule.bsl
Функция ЗаписьЗначенияРегистраСведенияИсторияПоКонтрагентам(Контрагент, Значение, ВидЗначения, НаДату = Неопределено) Экспорт //rarus bonmak 03.06.2020 16165 ++
	
	Отказ = Ложь;
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора   = Новый Структура("Контрагент,ВидЗначения", Контрагент,ВидЗначения);
		СтруктураСведений = РегистрыСведений.Scan_ИсторияПоКонтрагентам.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
		ЗначениеСтарое    = СтруктураСведений.Значение;
		Записывать        = Ложь;
		//Введено значение, а старое отсутствует
		Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое = Неопределено Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если НЕ ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Введено значение и было введено старое
		Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда
			//Значение изменилось
			Если Значение <> ЗначениеСтарое Тогда 
				Записывать = Истина; 
			КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение параметра изменилось
			ЗаписьРегСведений = РегистрыСведений.Scan_ИсторияПоКонтрагентам.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Контрагент	  = Контрагент;
			ЗаписьРегСведений.ВидЗначения     = ВидЗначения;
			ЗаписьРегСведений.Значение        = Значение;
			ЗаписьРегСведений.Период          = ДатаЗаписи;
			ЗаписьРегСведений.Пользователь    = ПользователиКлиентСервер.ТекущийПользователь();
			
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				Сообщить(НСтр("ru = 'Ошибка записи параметра контрагента в регистр сведений'; en = 'Error writing counterparty parameter to the information register'"));
				Отказ = Истина;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
		
	Возврат Отказ;
КонецФункции //rarus bonmak 03.06.2020 16165 --
